In [12]:
import numpy as np
import pandas as pd
from IPython.display import display
pd.read_csv(r'C:\Users\Shani\OneDrive\Documents\school\Ecom\dataScience\dataScience-Lec5-9-MAR-25\example.csv')
df=pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [84]:
#Class Exercise=Dataframe functions
tips= pd.read_csv("tips.csv",index_col='Payment ID')
display(tips)
df=tips.copy()
df=df[['Payer Name','tip','total_bill']]
df['total_payment']=df['total_bill']+df['tip']
df['tip_precentage']=(df['tip']/df['total_payment'])*100
# df.insert(1,'total_payment',total_payment)
# df.insert(1,'tip_precentage',(df['tip']/total_payment)*100)
display(df)
df.drop('total_payment',axis=1,inplace=True)
df.drop('tip_precentage',axis=1,inplace=True)
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

,Payer Name,tip,total_bill,total_payment,tip_precentage
Payment ID,,,,,
Sun2959,Christy Cunningham,1.01,16.99,18.00,5.611111
Sun4608,Douglas Tucker,1.66,10.34,12.00,13.833333
Sun4458,Travis Walters,3.50,21.01,24.51,14.279886
Sun5260,Nathaniel Harris,3.31,23.68,26.99,12.263801
Sun2251,Tonya Carter,3.61,24.59,28.20,12.801418
...,...,...,...,...,...
Sat2657,Michael Avila,5.92,29.03,34.95,16.938484
Sat1766,Monica Sanders,2.00,27.18,29.18,6.854010
Sat3880,Keith Wong,2.00,22.67,24.67,8.107013
Sat17,Dennis Dixon,1.75,17.82,19.57,8.942259
Thur672,Michelle Hardin,3.00,18.78,21.78,13.774105

                    Payer Name   tip  total_bill
Payment ID
Sun2959     Christy Cunningham  1.01       16.99
Sun4608         Douglas Tucker  1.66       10.34
Sun4458         Travis Walters  3.50       21.01
Sun5260       Nathaniel Harris  3.31       23.68
Sun2251           Tonya Carter  3.61       24.59
...                        ...   ...         ...
Sat2657          Michael Avila  5.92       29.03
Sat1766         Monica Sanders  2.00       27.18
Sat3880             Keith Wong  2.00       22.67
Sat17             Dennis Dixon  1.75       17.82
Thur672        Michelle Hardin  3.00       18.78

[244 rows x 3 columns]